Tekla.Structures.DrawingInternal.AssociativityManager.GridLinesLabel
Cache of the grid line names in the model

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetAllDimensionPointAssociations(System.Int32,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the dimension points.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension points
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionStartPointAssociations(System.Int32,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the start point of a dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension start point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionEndPointAssociations(System.Int32,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the end point of a dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension end point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionZeroPointAssociations(System.Int32,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rules associating objects to the zero point of the dimension set of a dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rules for the dimension set zero point
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryGetDimensionRebarOrBoltAssociations(System.Int32,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieve the rebar or bolt specific rules for the dimension.
dimensionId: ID of the drawing dimension under consideration
rules: rebar or bolt rules for the dimension
Returns: true in case of success, false otherwise

Tekla.Structures.DrawingInternal.AssociativityManager.TryCreateFilterFromSelectedDimensions
Creates a model object filter suitable to be used in dimensioning
Returns: name of the create filter or empty string in case of failure

Tekla.Structures.DrawingInternal.AssociativityManager.CollectTargetAttributes(Tekla.Structures.Model.Model,Tekla.Structures.Identifier,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.FilterRuleInfo}@)


Tekla.Structures.DrawingInternal.AssociativityManager.GetAttributesFileBasePathname(Tekla.Structures.Model.Model,System.String)


Tekla.Structures.DrawingInternal.AssociativityManager.GetDimensionPointRules(System.Int32,Tekla.Structures.DrawingInternal.AssociativityCommandEnum,System.Collections.Generic.List{Tekla.Structures.DrawingInternal.PointAssociativityRule}@)
Retrieves the associativity rules about dimension end points.
dimensionId: Id of the dimension under consideration
command: fetch associations with start point or end point
outputList: list of point rules (intersection of planes)
Returns: true in case of success, false otherwise